# --------------------------------------------------------------------------------------------------------------------------------------------
# Аутентификация — это процесс проверки подлинности. 
# Термин чаще всего используют в среде информационных технологий. 
# Сравнение пароля, введенного пользователем, с паролем, который сохранен в базе данных сервера, — один из примеров аутентификации. 
# TODO: План для аутентификации: -------------------------------------------------------------------------------------------------------------
# Аутентификация по логину и паролю
# Аутентификация по OAuth-авторизации 
# --------------------------------------------------------------------------------------------------------------------------------------------
# Возврашаем Session-токен
# --------------------------------------------------------------------------------------------------------------------------------------------

from fastapi import APIRouter, Depends
from fastapi.security import OAuth2PasswordRequestForm

from models.datebase import get_async_session

from sqlalchemy.ext.asyncio import AsyncSession

auth_router = APIRouter(
    prefix='/auth',
    tags=['auth']
)

@auth_router.post('/login')
async def login(
    form_data: OAuth2PasswordRequestForm = Depends(), 
    session: AsyncSession = Depends(get_async_session)
):
    pass







